DataProcessors/СМ_СкопироватьФайл_REF_XML_сСайта_DROM_RU_ИЗагрузитьСправочники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СМ_СкопироватьФайл_REF_XML_сСайта_DROM_RU_ИЗагрузитьСправочники</Name>
			<Comment>Скопировать файл REF.XML с сайта DROM.RU и загрузить справочники</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПределСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/СМ_ДромМодели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СМ_ДромМодели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДромМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ДромМарка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СМ_ДромРынки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СМ_ДромРынки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дром_Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ДромГорода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СМ_ДромСертификационныеПрограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СМ_ДромСертификационныеПрограммы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дром_Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ДромМарка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДромИнформацияОСертификационнойПрограмме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СМ_СкопироватьФайл_REF_XML_сСайта_DROM_RU_ИЗагрузитьСправочники/Ext/ObjectModule.bsl
Процедура ДромЗагрузкаСправочниковМодуль() Экспорт
	
	ВнутреннийАдресСервера = "https://www.drom.ru/cached_files/autoload/files/ref.xml";
	
	ИмяФайлаНазначение = ПолучитьИмяВременногоФайла("xml");
	ФайлНаДиске = Новый Файл(ИмяФайлаНазначение);
	
	Для Счетчик = 1 По 10 Цикл
		КопироватьФайл(ВнутреннийАдресСервера,ИмяФайлаНазначение);
		Если ФайлНаДиске.Существует() Тогда
			Прервать;
		КонецЕсли;
		Пауза30секунд = 30;
		КонДата = ТекущаяДата() + Пауза30секунд;
		Пока ТекущаяДата() < КонДата Цикл
			//...  
		КонецЦикла;
	КонецЦикла; 
	
	Если НЕ ФайлНаДиске.Существует() Тогда
		#Если НаКлиенте Тогда
			Попытка
				Сообщить("ОШИБКА! Информация с сайта не скопирована в файл: <"+СокрЛП(ИмяФайлаНазначение)+">",СтатусСообщения.ОченьВажное);
			Исключение
				//				
			КонецПопытки;		 
		#КонецЕсли
		Возврат;
	Иначе
		#Если НаКлиенте Тогда
			Попытка
				Сообщить("Информация с сайта скопирована в файл: <"+СокрЛП(ФайлНаДиске.ПолноеИмя)+">");
			Исключение
				//				
			КонецПопытки;		 
		#КонецЕсли
	КонецЕсли; 
	
	ёё = 0;
	
  	ЭтоМарка           = Ложь;
  	ЭтоМодель          = Ложь;	
  	ЭтоГород           = Ложь;	
   	ЭтоНовыйТип        = Ложь;	
	ЭтоТипКузова       = Ложь;
	ЭтоЦвет            = Ложь;
 	ЭтоТипКПП          = Ложь;
 	ЭтоВидДвигателя    = Ложь; 
 	ЭтоГибрид          = Ложь;
 	ЭтоПовреждения     = Ложь; 
	ЭтоГБО             = Ложь;
	ЭтоПривод          = Ложь;
	ЭтоРуль            = Ложь; 
	ЭтоРоссия          = Ложь;
	ЭтоМестонахождения = Ложь;
	ЭтоРынок           = Ложь;
	ЭтоПрограмма       = Ложь;
	ЭтоСкидка          = Ложь;
 	
	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНазначение); 
	
	Счетчик = 0;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Счетчик = Счетчик + 1;
		
		Если ПределСтрок > 0 Тогда
			Если Счетчик > ПределСтрок Тогда
				Прервать;
			КонецЕсли;			                                
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекущееИмя = ЧтениеXML.Имя;					
			#Если Клиент Тогда
				Если Отладка Тогда 	СМГ_Сообщить("Начало элемента "+ТекущееИмя); КонецЕсли;
			#КонецЕсли
			Если ТекущееИмя="Mark"             Тогда ЭтоМарка = Истина; 	      Наименование = ""; Артикул = "";	            	                 КонецЕсли;
			Если ТекущееИмя="Model"            Тогда ЭтоМодель = Истина;	      Наименование = ""; Артикул = ""; ДромМарка = "";                   КонецЕсли;
			Если ТекущееИмя="City"             Тогда ЭтоГород = Истина;	          Наименование = ""; Артикул = "";	                 			     КонецЕсли;
			Если ТекущееИмя="NewType"          Тогда ЭтоНовыйТип = Истина;        Наименование = ""; Артикул = "";	                 	    		 КонецЕсли;
 			Если ТекущееИмя="FrameType"        Тогда ЭтоТипКузова = Истина;       Наименование = ""; Артикул = "";	                    			 КонецЕсли;
 			Если ТекущееИмя="Color"            Тогда ЭтоЦвет = Истина;            Наименование = ""; Артикул = "";	                    			 КонецЕсли;
 			Если ТекущееИмя="Transmission"     Тогда ЭтоТипКПП = Истина;          Наименование = ""; Артикул = "";	                    			 КонецЕсли;
 			Если ТекущееИмя="EngineType"       Тогда ЭтоТипКПП = Истина;          Наименование = ""; Артикул = "";	                    			 КонецЕсли;
 			Если ТекущееИмя="HybridType"       Тогда ЭтоГибрид = Истина;          Наименование = ""; Артикул = "";	                    			 КонецЕсли;
 			Если ТекущееИмя="DamagedType"      Тогда ЭтоПовреждения = Истина;     Наименование = ""; Артикул = "";	                    			 КонецЕсли;
			Если ТекущееИмя="sGbo" Тогда 
				Если НЕ ЭтоГБО Тогда
					ЭтоГБО = Истина;          Наименование = ""; Артикул = "";	      			   
  				КонецЕсли;
			КонецЕсли;		                                                                                                                 
			Если ТекущееИмя="DriveType"        Тогда ЭтоПривод = Истина; 	      Наименование = ""; Артикул = "";	                            	 КонецЕсли;
			Если ТекущееИмя="WheelType"        Тогда ЭтоРуль = Истина;            Наименование = ""; Артикул = "";	                     			 КонецЕсли;
			Если ТекущееИмя="HaulRussiaType"   Тогда ЭтоРоссия = Истина;          Наименование = ""; Артикул = "";	    	                         КонецЕсли;
			Если ТекущееИмя="WhereaboutType"   Тогда ЭтоМестонахождения = Истина; Наименование = ""; Артикул = "";              	    	         КонецЕсли;
			Если ТекущееИмя="Market"           Тогда ЭтоРынок = Истина;	          Наименование = ""; Артикул = ""; ДромГород = "";                   КонецЕсли;
			Если ТекущееИмя="CertProgram"      Тогда ЭтоПрограмма = Истина;	      Наименование = ""; Артикул = ""; ДромМарка = ""; ДромПрограмма=""; КонецЕсли;
			Если ТекущееИмя="DiscountType"     Тогда Этоскидка = Истина;          Наименование = ""; Артикул = "";              	    	         КонецЕсли;
		КонецЕсли;                                                                                                                           
		
 		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			ТекущееЗначение = ЧтениеXML.Значение;
			#Если Клиент Тогда
				Если Отладка Тогда 	СМГ_Сообщить("Текущее значение "+ТекущееЗначение);КонецЕсли;	
			#КонецЕсли
			Если ЭтоМарка Тогда
 				Если ТекущееИмя="idMark"              Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sMark"          Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;
			КонецЕсли;
			Если ЭтоМодель Тогда
				Если ТекущееИмя="idModel"             Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sModel"         Тогда Наименование = ТекущееЗначение;			
				ИначеЕсли ТекущееИмя="idMark"         Тогда ДромМарка = Справочники.СМ_ДромМарка.НайтиПоРеквизиту("Артикул",ТекущееЗначение);
				КонецЕсли;
			КонецЕсли;
			Если ЭтоГород Тогда
				Если ТекущееИмя="idCity"               Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sCity"           Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли; 
 			Если ЭтоНовыйТип Тогда
				Если ТекущееИмя="idNewType"            Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sNewType"        Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;
 			Если ЭтоТипКузова Тогда
				Если ТекущееИмя="idFrameType"          Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sFrameType"      Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;		
 			Если ЭтоЦвет Тогда
				Если ТекущееИмя="idColor"              Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sColor"          Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;		
 			Если ЭтоТипКПП Тогда
				Если ТекущееИмя="idTransmission"       Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sTransmission"   Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;
  			Если ЭтоВидДвигателя Тогда
				Если ТекущееИмя="idEngineType"         Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sEngineType"     Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;
  			Если ЭтоГибрид Тогда
				Если ТекущееИмя="idHybridType"         Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sHybridType"     Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;
   			Если ЭтоПовреждения Тогда
				Если ТекущееИмя="idDamagedType"        Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sDamagedType"    Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли; 
   			Если ЭтоГБО Тогда
				Если ТекущееИмя="idGbo"                Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sGbo"            Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли; 
   			Если ЭтоПривод Тогда
				Если ТекущееИмя="idDriveType"          Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sDriveType"      Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли; 
    		Если ЭтоРуль Тогда
				Если ТекущееИмя="idWheelType"          Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sWheelType"      Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;
     		Если ЭтоРоссия Тогда
				Если ТекущееИмя="idHaulRussiaType"     Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sHaulRussiaType" Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли; 
      		Если ЭтоМестонахождения Тогда
				Если ТекущееИмя="Whereabouts"          Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sWhereabouts"    Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли;
			Если ЭтоРынок Тогда
				Если ТекущееИмя="idMarket"             Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sMarket"         Тогда Наименование = ТекущееЗначение;			
				ИначеЕсли ТекущееИмя="idCity"          Тогда ДромГород = Справочники.СМ_ДромГорода.НайтиПоРеквизиту("Артикул",ТекущееЗначение);
				КонецЕсли;
			КонецЕсли;
			Если ЭтоПрограмма Тогда
				Если ТекущееИмя="idCertProgram"        Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sCertProgram"    Тогда Наименование = ТекущееЗначение;			
				ИначеЕсли ТекущееИмя="idMark"          Тогда ДромМарка = Справочники.СМ_ДромМарка.НайтиПоРеквизиту("Артикул",ТекущееЗначение);
				ИначеЕсли ТекущееИмя="infoCertProgram" Тогда ДромПрограмма = ТекущееЗначение;			
				КонецЕсли;
			КонецЕсли;
			Если ЭтоСкидка Тогда
				Если ТекущееИмя="idDiscountType"       Тогда Артикул = ТекущееЗначение; 
				ИначеЕсли ТекущееИмя="sDiscountType"   Тогда Наименование = ТекущееЗначение;			
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;	
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ТекущееИмя = ЧтениеXML.Имя;
			#Если Клиент Тогда
				Если Отладка Тогда 	СМГ_Сообщить("Конец элемента "+ТекущееИмя);	КонецЕсли;	
			#КонецЕсли	
			Если ТекущееИмя="Mark" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда
					МаркаДром =  НайтиСоздатьМарку(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = "";	ЭтоМарка = Ложь;
			КонецЕсли;
			Если ТекущееИмя="Model" Тогда
				Если Наименование <> "" И Артикул  <> "" И Не обЗначениеНеЗаполнено(ДромМарка) Тогда
					МодельДром =  НайтиСоздатьМодель(Наименование,Артикул,ДромМарка);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ДромМарка  = Справочники.СМ_ДромМарка.ПустаяСсылка();	ЭтоМодель = Ложь;
			КонецЕсли;
			Если ТекущееИмя="City" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда
					ГородДром =  НайтиСоздатьГород(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоГород = Ложь;
			КонецЕсли;
 			Если ТекущееИмя="NewType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					НовыйТипДром =  НайтиСоздатьНовыйТип(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоНовыйТип = Ложь;
			КонецЕсли;
 			Если ТекущееИмя="FrameType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ТипКузоваДром =  НайтиСоздатьТипКузова(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоТипКузова = Ложь;
			КонецЕсли;
 			Если ТекущееИмя="Color" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ЦветДром =  НайтиСоздатьЦвет(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоЦвет = Ложь;
			КонецЕсли;
 			Если ТекущееИмя="Transmission" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ТипКППДром =  НайтиСоздатьТипКПП(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоТипКПП = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="EngineType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ВидДвигателяДром =  НайтиСоздатьВидДвигателя(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоВидДвигателя = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="HybridType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ГибридДром =  НайтиСоздатьГибрид(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоГибрид = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="DamagedType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ПоврежденияДром =  НайтиСоздатьПовреждения(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоПовреждения = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="sGbo" И ЭтоГБО Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ГБОДром =  НайтиСоздатьГБО(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоГБО = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="DriveType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					ПриводДром =  НайтиСоздатьПривод(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоПривод = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="WheelType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					РульДром =  НайтиСоздатьРуль(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоРуль = Ложь;
			КонецЕсли;
  			Если ТекущееИмя="HaulRussiaType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					РульДром =  НайтиСоздатьРоссия(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоРоссия = Ложь;
			КонецЕсли;
   			Если ТекущееИмя="WhereaboutType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда         
 					МестонахожденияДром =  НайтиСоздатьМестонахождения(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоМестонахождения = Ложь;
			КонецЕсли;
			Если ТекущееИмя="Market" Тогда
				Если Наименование <> "" И Артикул  <> "" И Не обЗначениеНеЗаполнено(ДромГород) Тогда
					РынокДром =  НайтиСоздатьРынок(Наименование,Артикул,ДромГород);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ДромГород  = Справочники.СМ_ДромГорода.ПустаяСсылка(); ЭтоРынок = Ложь; 
			КонецЕсли;
			Если ТекущееИмя="CertProgram" Тогда
				Если Наименование <> "" И Артикул  <> "" И Не обЗначениеНеЗаполнено(ДромМарка) Тогда
					ПрограммаДром =  НайтиСоздатьСертификационнуюПрограмму(Наименование,Артикул,ДромМарка,ДромПрограмма);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ДромМарка  = Справочники.СМ_ДромМарка.ПустаяСсылка(); ЭтоСертификационнаяПрограмма = Ложь; 
			КонецЕсли;
			Если ТекущееИмя="DiscountType" Тогда
				Если Наименование <> "" И Артикул  <> "" Тогда
					СкидкаДром =  НайтиСоздатьТипыСкидок(Наименование,Артикул);
				КонецЕсли;
				Наименование = "";	Артикул = ""; ЭтоСкидка = Ложь; 
			КонецЕсли;

  		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	
	
КонецПроцедуры

Функция НайтиСоздатьМарку(Наименование,Артикул) Экспорт
	
	НовМарка = Справочники.СМ_ДромМарка.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромМарка.Ссылка,
	|	СМ_ДромМарка.Наименование,
	|	СМ_ДромМарка.Артикул
	|ИЗ
	|	Справочник.СМ_ДромМарка КАК СМ_ДромМарка
	|ГДЕ
	|	СМ_ДромМарка.Наименование = &Наименование
	|	И СМ_ДромМарка.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМарка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМарка) Тогда
		НовМарка = Справочники.СМ_ДромМарка.СоздатьЭлемент();
		НовМарка.УстановитьНовыйКод("");
		НовМарка.Наименование = Наименование;
		НовМарка.Артикул = Артикул;
		Попытка НовМарка.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовМарка.Ссылка;
	
КонецФункции // НайтиИлиСоздатьМарку(Наименование,Артикул) 

Функция НайтиСоздатьМодель(Наименование,Артикул,ДромМарка) Экспорт
	
	НовМодель = Справочники.СМ_ДромМодели.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромМодели.Ссылка,
	|	СМ_ДромМодели.Наименование,
	|	СМ_ДромМодели.Артикул,
	|	СМ_ДромМодели.ДромМарка
	|ИЗ
	|	Справочник.СМ_ДромМодели КАК СМ_ДромМодели
	|ГДЕ
	|	СМ_ДромМодели.Наименование = &Наименование
	|	И СМ_ДромМодели.Артикул = &Артикул
	|	И СМ_ДромМодели.ДромМарка = &ДромМарка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("ДромМарка", ДромМарка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодель = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодель) Тогда
		
		НовМодель = Справочники.СМ_ДромМодели.СоздатьЭлемент();
		НовМодель.Наименование = Наименование;
		НовМодель.Артикул = Артикул;
		НовМодель.ДромМарка = ДромМарка; 
		
		Попытка	НовМодель.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
	
	Возврат НовМодель.Ссылка;
	
КонецФункции // НайтиИлиСоздатьМодель(Наименование,Марка)

Функция НайтиСоздатьГород(Наименование,Артикул) Экспорт
	
	НовГород = Справочники.СМ_ДромГорода.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромГорода.Ссылка,
	|	СМ_ДромГорода.Наименование,
	|	СМ_ДромГорода.Артикул
	|ИЗ
	|	Справочник.СМ_ДромГорода КАК СМ_ДромГорода
	|ГДЕ
	|	СМ_ДромГорода.Наименование = &Наименование
	|	И СМ_ДромГорода.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовГород = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовГород) Тогда
		
		НовГород = Справочники.СМ_ДромГорода.СоздатьЭлемент();
		НовГород.Наименование = Наименование;
		НовГород.Артикул = Артикул;
		
		Попытка	НовГород.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
	
	Возврат НовГород.Ссылка;
	
КонецФункции // НайтиСоздатьГород(Наименование,Артикул) Экспорт

Функция НайтиСоздатьНовыйТип(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромНовыйТип.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромНовыйТип.Ссылка,
	|	СМ_ДромНовыйТип.Наименование,
	|	СМ_ДромНовыйТип.Артикул
	|ИЗ
	|	Справочник.СМ_ДромНовыйТип КАК СМ_ДромНовыйТип
	|ГДЕ
	|	СМ_ДромНовыйТип.Наименование = &Наименование
	|	И СМ_ДромНовыйТип.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромНовыйТип.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьНовыйТип(Наименование,Артикул) 

Функция НайтиСоздатьТипКузова(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромТипыКузовов.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромТипыКузовов.Ссылка,
	|	СМ_ДромТипыКузовов.Наименование,
	|	СМ_ДромТипыКузовов.Артикул
	|ИЗ
	|	Справочник.СМ_ДромТипыКузовов КАК СМ_ДромТипыКузовов
	|ГДЕ
	|	СМ_ДромТипыКузовов.Наименование = &Наименование
	|	И СМ_ДромТипыКузовов.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромТипыКузовов.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьТипКузова(Наименование,Артикул)

Функция НайтиСоздатьЦвет(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромЦвета.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромЦвета.Ссылка,
	|	СМ_ДромЦвета.Наименование,
	|	СМ_ДромЦвета.Артикул
	|ИЗ
	|	Справочник.СМ_ДромЦвета КАК СМ_ДромЦвета
	|ГДЕ
	|	СМ_ДромЦвета.Наименование = &Наименование
	|	И СМ_ДромЦвета.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромЦвета.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьЦвет(Наименование,Артикул)

Функция НайтиСоздатьТипКПП(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромТипыКПП.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромТипыКПП.Ссылка,
	|	СМ_ДромТипыКПП.Наименование,
	|	СМ_ДромТипыКПП.Артикул
	|ИЗ
	|	Справочник.СМ_ДромТипыКПП КАК СМ_ДромТипыКПП
	|ГДЕ
	|	СМ_ДромТипыКПП.Наименование = &Наименование
	|	И СМ_ДромТипыКПП.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромТипыКПП.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьЦвет(Наименование,Артикул)

Функция НайтиСоздатьВидДвигателя(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромВидДвигателя.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромВидДвигателя.Ссылка,
	|	СМ_ДромВидДвигателя.Наименование,
	|	СМ_ДромВидДвигателя.Артикул
	|ИЗ
	|	Справочник.СМ_ДромВидДвигателя КАК СМ_ДромВидДвигателя
	|ГДЕ
	|	СМ_ДромВидДвигателя.Наименование = &Наименование
	|	И СМ_ДромВидДвигателя.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромВидДвигателя.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьВидДвигателя(Наименование,Артикул)

Функция НайтиСоздатьГибрид(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромГибрид.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромГибрид.Ссылка,
	|	СМ_ДромГибрид.Наименование,
	|	СМ_ДромГибрид.Артикул
	|ИЗ
	|	Справочник.СМ_ДромГибрид КАК СМ_ДромГибрид
	|ГДЕ
	|	СМ_ДромГибрид.Наименование = &Наименование
	|	И СМ_ДромГибрид.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромГибрид.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьГибрид(Наименование,Артикул)

Функция НайтиСоздатьПовреждения(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромПовреждения.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромПовреждения.Ссылка,
	|	СМ_ДромПовреждения.Наименование,
	|	СМ_ДромПовреждения.Артикул
	|ИЗ
	|	Справочник.СМ_ДромПовреждения КАК СМ_ДромПовреждения
	|ГДЕ
	|	СМ_ДромПовреждения.Наименование = &Наименование
	|	И СМ_ДромПовреждения.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромПовреждения.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьПовреждения(Наименование,Артикул)

Функция НайтиСоздатьГБО(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромГБО.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромГБО.Ссылка,
	|	СМ_ДромГБО.Наименование,
	|	СМ_ДромГБО.Артикул
	|ИЗ
	|	Справочник.СМ_ДромГБО КАК СМ_ДромГБО
	|ГДЕ
	|	СМ_ДромГБО.Наименование = &Наименование
	|	И СМ_ДромГБО.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромГБО.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьГБО(Наименование,Артикул)

//DriveType
Функция НайтиСоздатьПривод(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромПривод.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромПривод.Ссылка,
	|	СМ_ДромПривод.Наименование,
	|	СМ_ДромПривод.Артикул
	|ИЗ
	|	Справочник.СМ_ДромПривод КАК СМ_ДромПривод
	|ГДЕ
	|	СМ_ДромПривод.Наименование = &Наименование
	|	И СМ_ДромПривод.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромПривод.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьПривод(Наименование,Артикул)

//WheelType
Функция НайтиСоздатьРуль(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромРуль.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромРуль.Ссылка,
	|	СМ_ДромРуль.Наименование,
	|	СМ_ДромРуль.Артикул
	|ИЗ
	|	Справочник.СМ_ДромРуль КАК СМ_ДромРуль
	|ГДЕ
	|	СМ_ДромРуль.Наименование = &Наименование
	|	И СМ_ДромРуль.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромРуль.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьРуль(Наименование,Артикул)

//HaulRussiaType
Функция НайтиСоздатьРоссия(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромРоссия.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромРоссия.Ссылка,
	|	СМ_ДромРоссия.Наименование,
	|	СМ_ДромРоссия.Артикул
	|ИЗ
	|	Справочник.СМ_ДромРоссия КАК СМ_ДромРоссия
	|ГДЕ
	|	СМ_ДромРоссия.Наименование = &Наименование
	|	И СМ_ДромРоссия.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромРоссия.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьРоссия(Наименование,Артикул)

//WhereaboutType
Функция НайтиСоздатьМестонахождения(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромМестонахождения.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромМестонахождения.Ссылка,
	|	СМ_ДромМестонахождения.Наименование,
	|	СМ_ДромМестонахождения.Артикул
	|ИЗ
	|	Справочник.СМ_ДромМестонахождения КАК СМ_ДромМестонахождения
	|ГДЕ
	|	СМ_ДромМестонахождения.Наименование = &Наименование
	|	И СМ_ДромМестонахождения.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромМестонахождения.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьМестонахождения(Наименование,Артикул)

//Market
Функция НайтиСоздатьРынок(Наименование,Артикул,ДромГород) Экспорт
	
	НовЭлемент = Справочники.СМ_ДромРынки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СД_ДромРынки.Ссылка,
	|	СД_ДромРынки.Наименование,
	|	СД_ДромРынки.Артикул,
	|	СД_ДромРынки.Дром_Город
	|ИЗ
	|	Справочник.СМ_ДромРынки КАК СД_ДромРынки
	|ГДЕ
	|	СД_ДромРынки.Наименование = &Наименование
	|	И СД_ДромРынки.Артикул = &Артикул
	|	И СД_ДромРынки.Дром_Город = &ДромГород";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("ДромГород", ДромГород);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
		
		НовЭлемент = Справочники.СМ_ДромРынки.СоздатьЭлемент();
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		НовЭлемент.Дром_Город = ДромГород; 
		
		Попытка	НовЭлемент.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьРынок(Наименование,Артикул,ДромГород)

//CertProgram
Функция НайтиСоздатьСертификационнуюПрограмму(Наименование,Артикул,ДромМарка,ДромПрограмма) Экспорт
	
	НовЭлемент = Справочники.СМ_ДромСертификационныеПрограммы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромСертификационныеПрограммы.Ссылка,
	|	СМ_ДромСертификационныеПрограммы.Наименование,
	|	СМ_ДромСертификационныеПрограммы.Артикул,
	|	СМ_ДромСертификационныеПрограммы.Дром_Марка
	|ИЗ
	|	Справочник.СМ_ДромСертификационныеПрограммы КАК СМ_ДромСертификационныеПрограммы
	|ГДЕ
	|	СМ_ДромСертификационныеПрограммы.Наименование = &Наименование
	|	И СМ_ДромСертификационныеПрограммы.Артикул = &Артикул
	|	И СМ_ДромСертификационныеПрограммы.Дром_Марка = &Дром_Марка";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Дром_Марка", ДромМарка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
		
		НовЭлемент = Справочники.СМ_ДромСертификационныеПрограммы.СоздатьЭлемент();
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		НовЭлемент.Дром_Марка = ДромМарка;
		НовЭлемент.ДромИнформацияОСертификационнойПрограмме = ДромПрограмма;		
		
		Попытка	НовЭлемент.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
   	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьСертификационнуюПрограмму(Наименование,Артикул,Дром_Марка,ДромПрограмма)

//DiscountType 
Функция НайтиСоздатьТипыСкидок(Наименование,Артикул) Экспорт
	
 	НовЭлемент = Справочники.СМ_ДромТипыСкидок.ПустаяСсылка();
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ДромТипыСкидок.Ссылка,
	|	СМ_ДромТипыСкидок.Наименование,
	|	СМ_ДромТипыСкидок.Артикул
	|ИЗ
	|	Справочник.СМ_ДромТипыСкидок КАК СМ_ДромТипыСкидок
	|ГДЕ
	|	СМ_ДромТипыСкидок.Наименование = &Наименование
	|	И СМ_ДромТипыСкидок.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
   	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭлемент = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовЭлемент) Тогда
  		НовЭлемент = Справочники.СМ_ДромТипыСкидок.СоздатьЭлемент();
 		НовЭлемент.УстановитьНовыйКод("");
		НовЭлемент.Наименование = Наименование;
		НовЭлемент.Артикул = Артикул;
		Попытка НовЭлемент.Записать(); Исключение  КонецПопытки;
	КонецЕсли; 	
	
	Возврат НовЭлемент.Ссылка;
	
КонецФункции // НайтиСоздатьТипыСкидок(Наименование,Артикул)
